ecokater/-OpenMV-STM32-tennis-pickup-robot/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "mysys.h"
#include "led.h"
#include "motor.h"
#include "car_remote_ui.h"
#include "carcontrol.h"
#include "usart.h"
#include "sdram.h"  
#include "lcd_rgb.h"
#include "touch_800x480.h"

#include "openmv_spi.h"
#include "openmv_uart.h"
#include "car_ball_pid.h"
#include "esp32_link.h"
#include "servo_uart5.h"
#include "ui.h"

#include "lcd_test.h"
#include <string.h>


#include "lvgl.h"
#include "lv_port_disp.h"
#include "lv_port_indev.h"
#include "others/sysmon/lv_sysmon.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEBUG_UART_LOG_ENABLE 0
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SD_HandleTypeDef hsd1;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi5;
DMA_HandleTypeDef hdma_spi1_rx;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart5;
UART_HandleTypeDef huart7;
UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_uart4_rx;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

osThreadId ledTaskHandle;
osThreadId fputTaskHandle;
osThreadId takeDataTaskHandle;
osThreadId processTaskHandle;
osThreadId servoTrackTaskHandle;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Initialize(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_RTC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPI5_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_LTDC_Init(void);
static void MX_SPI1_Init(void);
static void MX_UART4_Init(void);
static void MX_UART5_Init(void);
static void MX_TIM2_Init(void);
static void MX_UART7_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

void StartLedTask(void const * argument);
void StartFputTask(void const * argument);
void StartTakeDataTask(void const * argument);
void StartOpenmvProcessTask(void const * argument);
void StartServoTrackTask(void const * argument);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static uint8_t g_defer_ltdc_init = 1;
static uint8_t g_servo_task_enabled = 0;

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  mysysinit();
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_DCMI_Init();
  MX_DMA2D_Init();
  MX_FMC_Init();
  MX_QUADSPI_Init();
  MX_SDMMC1_SD_Init();
  MX_SPI5_Init();
  MX_USART1_UART_Init();
  MX_LTDC_Init();
  MX_SPI1_Init();
  MX_UART4_Init();
  MX_UART5_Init();
  MX_TIM2_Init();
  MX_UART7_Init();
  /* USER CODE BEGIN 2 */
  User_MX_FMC_Init();
  g_defer_ltdc_init = 0;
  MX_LTDC_Init();
  User_MX_LTDC_Init();
  User_USART1_Init();
  motor_init();
  car_init();
  servo_startup_self_test();
  LED_Init();
  Touch_Init();				// 触摸屏初始化	

	lv_init();					//	LVGL��ʼ��
	lv_port_disp_init();		//	LVGL��ʾ�ӿڳ�ʼ��
	lv_port_indev_init();	// LVGL�����ӿڳ�ʼ��		
	
  ui_init();   
  lv_sysmon_show_performance(NULL);
  openmv_spi_init();


  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */

  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 2048);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  osThreadDef(ledTask, StartLedTask, osPriorityLow, 0, 128);
  ledTaskHandle = osThreadCreate(osThread(ledTask), NULL);
  /* add threads, ... */
  if (DEBUG_UART_LOG_ENABLE != 0)
  {
    osThreadDef(fputTask, StartFputTask, osPriorityLow, 0, 512);
    fputTaskHandle = osThreadCreate(osThread(fputTask), NULL);
  }
  else
  {
    fputTaskHandle = NULL;
  }
  
  /* 专门用于 OpenMV 数据处理的高优先级任务 */
  osThreadDef(takeDataTask, StartTakeDataTask, osPriorityHigh, 0, 384);
  takeDataTaskHandle = osThreadCreate(osThread(takeDataTask), NULL);
  
  /* 专门负责 SPI 图像处理的高优先级任务 */
  osThreadDef(processTask, StartOpenmvProcessTask, osPriorityNormal, 0, 384);
  processTaskHandle = osThreadCreate(osThread(processTask), NULL);

  osThreadDef(servoTrackTask, StartServoTrackTask, osPriorityHigh, 0, 256);
  servoTrackTaskHandle = osThreadCreate(osThread(servoTrackTask), NULL);
  if (servoTrackTaskHandle == NULL)
  {
    g_servo_task_enabled = 0;
  }
  else
  {
    g_servo_task_enabled = 1;
  }
  
