ecokater/-OpenMV-STM32-tennis-pickup-robot/Core/Src/main.c
  /* USER CODE BEGIN FMC_Init 2 */

  /* USER CODE END FMC_Init 2 */
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOK_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(PICKUP_EN_GPIO_Port, PICKUP_EN_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, AIN1_Pin|AIN2_Pin|BIN1_Pin|BIN2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, CIN2_Pin|CIN1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, DIN1_Pin|DIN2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : PC6 */
  GPIO_InitStruct.Pin = PICKUP_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(PICKUP_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : AIN1_Pin AIN2_Pin BIN1_Pin BIN2_Pin */
  GPIO_InitStruct.Pin = AIN1_Pin|AIN2_Pin|BIN1_Pin|BIN2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : CIN2_Pin CIN1_Pin */
  GPIO_InitStruct.Pin = CIN2_Pin|CIN1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : DIN1_Pin DIN2_Pin */
  GPIO_InitStruct.Pin = DIN1_Pin|DIN2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void StartLedTask(void const * argument)
{
    for(;;)
  {

		osDelay(500);		
		LED1_Toggle;			// LED��˸
  }
}

/* 专门负责处理 OpenMV 数据的任务 (UART) */
void StartTakeDataTask(void const * argument)
{
    /* 初始化 UART4 DMA 接收 */
    openmv_uart_init();
    esp32_control_init();
    car_ball_pid_init();
    if (g_servo_task_enabled == 0)
    {
        servo_pid_init();
    }
    
    for(;;)
    {
        /* 处理 UART4 数据 */
        openmv_uart_process();
        esp32_control_process();
        if (esp32_control_get_mode() == ESP32_CONTROL_MODE_PICKUP)
        {
            if (g_servo_task_enabled == 0)
            {
                servo_pid_track_from_uart();
            }
            car_ball_pid_track_from_uart();
        }
        
        osDelay(1);
    }
}

void StartServoTrackTask(void const * argument)
{
    servo_pid_init();

    for(;;)
    {
        if (esp32_control_get_mode() == ESP32_CONTROL_MODE_PICKUP)
        {
            servo_pid_track_from_uart();
        }
        osDelay(5);
    }
}

/* 专门负责 SPI 图像处理的任务 */
void StartOpenmvProcessTask(void const * argument)
{
    for(;;)
    {
        /* 高频处理，确保双缓冲及时流转 */
        openmv_process();
        
        /* 检查超时：如果超过 500ms 没收到有效帧，就重启 SPI */
        openmv_check_timeout(500);
        
        osDelay(1);
    }
}

//fput任务（DMA接收测试输出）
void StartFputTask(void const * argument)
{
    openmv_meta_t openmv_data = {0};
    openmv_uart_data_t uart_data = {0};
    uint32_t last_spi_seq = 0;
    uint32_t last_uart_seq = 0;

    HAL_UART_Transmit(&huart1, (uint8_t *)"\r\n=== SPI & UART DATA MONITOR ===\r\n", 33, 100);

    for(;;)
    {
        /* 检查 SPI 或 UART 是否有新数据 */
        uint32_t curr_spi_seq = openmv_get_data_seq();
        uint32_t curr_uart_seq = openmv_uart_get_seq();
        
        if (curr_spi_seq != last_spi_seq || curr_uart_seq != last_uart_seq)
        {
            last_spi_seq = curr_spi_seq;
            last_uart_seq = curr_uart_seq;
            
            /* 获取最新数据 */
            openmv_get_meta(&openmv_data);
            openmv_uart_get_data(&uart_data);
            
            /* 打印合并后的状态 */
            printf("SPI_Seq:%lu UART_Seq:%lu | ROI(%d,%d) | Ball(%d,%d)\r\n",
                   (unsigned long)curr_spi_seq,
                   (unsigned long)curr_uart_seq,
                   openmv_data.roi_x,
                   openmv_data.roi_y,
                   uart_data.ball_x,
                   uart_data.ball_y);
        }
        else
        {
            /* 没收到数据时，打印调试信息 */
            /* 打印 UART4 ISR 寄存器，看看有没有 RXNE, ORE, FE 等标志 */
            /* ISR 寄存器定义因系列而异，H7 通常是 ISR */
            printf("Waiting... ISR=0x%08lX CNDTR=%lu\r\n", 
                   huart4.Instance->ISR,
                   __HAL_DMA_GET_COUNTER(huart4.hdmarx));
        }
        osDelay(100); /* 降低打印频率 */
    }
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */











  ///////////////////图像显示//////////////////////////////////////
/* OpenMV Canvas 相关变量 */
static lv_obj_t *openmv_canvas = NULL;
/* 静态分配 Canvas 缓冲区 (RGB565, 80x80) */
/* 使用 LV_CANVAS_BUF_SIZE 宏计算大小更严谨，但这里直接给足空间 */
static uint8_t canvas_buf[80 * 80 * 2];

void app_create_openmv_canvas(void)
{
    /* 创建 Canvas 对象，挂载到当前屏幕 */
    openmv_canvas = lv_canvas_create(lv_scr_act());
    
    /* 设置缓冲区 (80x80, RGB565) */
    lv_canvas_set_buffer(openmv_canvas, canvas_buf, 80, 80, LV_COLOR_FORMAT_RGB565);
    
    /* 居中显示 */
    lv_obj_center(openmv_canvas);
    
    /* 填充黑色背景 */
    lv_canvas_fill_bg(openmv_canvas, lv_color_hex(0x000000), LV_OPA_COVER);
}

void app_update_openmv_canvas(void)
{
    if (openmv_canvas == NULL) return;
    
